РП/src/Catalogs/ЗарплатныеПроекты/ЗарплатныеПроекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗарплатныеПроекты</name>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЭлектронныйДокументооборотСБанком</name>
    <comment>При использовании, факт оплаты банком платежных ведомостей регистрируется в системе при загрузке файла подтверждения из банка</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаФайла</name>
    <type>
      <types>EnumRef.КодировкаФайловОбменаПоЗарплатномуПроекту</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтделениеБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФилиалОтделенияБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматФайла</name>
    <type>
      <types>EnumRef.ФорматыФайловОбменаПоЗарплатномуПроекту</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СистемыРасчетовПоБанковскимКартам</name>
    <attributes>
      <name>СистемаРасчетовПоБанковскимКартам</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РП/src/Enums/КодировкаФайловОбменаПоЗарплатномуПроекту/КодировкаФайловОбменаПоЗарплатномуПроекту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодировкаФайловОбменаПоЗарплатномуПроекту</name>
  <enumValues>
    <name>UTF8</name>
  </enumValues>
  <enumValues>
    <name>Windows1251</name>
  </enumValues>
</mdclass:Enum>

РП/src/Catalogs/ЗарплатныеПроекты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов


#Область СлужебныеПроцедурыИФункции

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

Процедура ЗаполнитьКодировкуФайловОбменаПоЗарплатнымПроектам() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗарплатныеПроекты.Ссылка
	|ИЗ
	|	Справочник.ЗарплатныеПроекты КАК ЗарплатныеПроекты
	|ГДЕ
	|	ЗарплатныеПроекты.КодировкаФайла <> ЗНАЧЕНИЕ(Перечисление.КодировкаФайловОбменаПоЗарплатномуПроекту.ПустаяСсылка)";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		// Обновление уже выполнялось
		Возврат;
		
	КонецЕсли;
	
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	ЗарплатныеПроекты.Ссылка
	|ИЗ
	|	Справочник.ЗарплатныеПроекты КАК ЗарплатныеПроекты
	|ГДЕ
	|	ЗарплатныеПроекты.ИспользоватьЭлектронныйДокументооборотСБанком";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗарплатныйПроект = Выборка.Ссылка.ПолучитьОбъект();
		ЗарплатныйПроект.КодировкаФайла = Перечисления.КодировкаФайловОбменаПоЗарплатномуПроекту.UTF8;
		ЗарплатныйПроект.ОбменДанными.Загрузка = Истина;
		ЗарплатныйПроект.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
